# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Jared\Documents\PSoC Creator\MasterControllerBoard\MasterController\MPU_9150.cydsn\MPU_9150.cyprj
# Date: Sun, 01 Mar 2015 00:51:12 GMT
#set_units -time ns
create_clock -name {I2C_1_SCBCLK(FFB)} -period 166.66666666666666 -waveform {0 83.3333333333333} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {I2C_1_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 5 9} [list]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]


# Component constraints for C:\Users\Jared\Documents\PSoC Creator\MasterControllerBoard\MasterController\MPU_9150.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Jared\Documents\PSoC Creator\MasterControllerBoard\MasterController\MPU_9150.cydsn\MPU_9150.cyprj
# Date: Sun, 01 Mar 2015 00:50:38 GMT
