# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Steve\Desktop\Projects\MarsRover\BYU-Mars-Rover\RoverLink\RoverLink.cydsn\RoverLink.cyprj
# Date: Fri, 21 Nov 2014 06:42:33 GMT
#set_units -time ns
create_clock -name {UART_SCBCLK(FFB)} -period 708.33333333333326 -waveform {0 354.166666666667} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {SPIM_IntClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 13 25} [list [get_pins {ClockBlock/udb_div_0}]]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 17 35} -nominal_period 708.33333333333326 [list]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]


# Component constraints for C:\Users\Steve\Desktop\Projects\MarsRover\BYU-Mars-Rover\RoverLink\RoverLink.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Steve\Desktop\Projects\MarsRover\BYU-Mars-Rover\RoverLink\RoverLink.cydsn\RoverLink.cyprj
# Date: Fri, 21 Nov 2014 06:42:28 GMT
